<template>
    <div>
       <h1>性能优化</h1>
       <p>性能优化主要从以下几个方面入手：</p>
       <h2>1. 构建性能</h2>
       <p>2. 传输性能</p>
       <p>3. 运行性能</p>
       <h2>1. 构建性能</h2>
       <p>构建性能是指:从打包开始到打包完毕或者从修改之后点击保存自动打包到页面的更新过程,整个过程都是在开发阶段进行的</p>
       <p>开发阶段优化了构建性能，可以大大的提高打包速度，从而提升了开发效率</p>
       <p>构建性能主要可以从以下几个方面考虑：</p>
       <h3>1. 减少模块解析</h3>
       <p>webpack中模块解析包括：抽象语法树分析、依赖分析、模块语法替换</p>
       <h4>不进行解析的模块会怎样？</h4>
       <p>不做解析的模块，在loader处理之后就直接输出</p>
       <p>不做解析的模块，就少了上面的步骤，从而提升了打包速度</p>
       <h4>模块不需要解析的前提条件：</h4>
       <p>模块中无其他依赖，如：jquery</p>
       <h4>配置如下：</h4>
       <pre>
            module.exports = {
                //...
                module: {
                    noParse: /jquery|lodash/,  // 不解析jqery和loadsh
                }
            };
       </pre>
       <h2>2. 传输性能</h2>
       <p>传输性能是指：文件从服务端传输到客户端的过程所需要的时间</p>
       <p>传输性能的提升可以缩短从页面请求到呈现的时间，可以从以下几个方面考虑：</p>
       <p> 2.1 总传输量：将所有的传输文件内容都加起来就是总传输</p>
       <p> 2.2 文件数量：需要传输的所有文件数量 </p>
       <p> 2.3 浏览器缓存： 通过设置可以使得浏览器缓存传输的文件，被缓存的文件再次获取就会从缓存中获取</p>
       <h2>3. 运行性能</h2>
       <p>编写高效的代码</p>


    </div>     
</template>
<script>
export default {
    metaInfo: {   // 使用vue-meta-info插件
      title: '性能优化', // set a title
      meta: [{                 // set meta
        name: '性能优化',
        content: '性能优化'
      }],
      link: [{                 // set link
        rel: '性能优化',
        href: ''
      }]
    }
}
</script>
<style>

</style>