<template>
    <div>
        <h1>线性数据结构</h1>
        <h3>什么是线性数据结构？</h3>
        <pre>
        一个位置存储一个值，一对一的关系，
        线性数据结构中有两种不同的存储结构：
            1. 顺序存储，顺序存储的线性表称为顺序表，顺序表中数据是连续存储的
            2. 链式存储，链式存储的线性表称为链表，链表中数据是可以不连续存储的，链表中存储着当前数据和
            相邻数据的地址
        </pre>
        <h3>顺序存储</h3>
        <pre>
        在内存中找一块地址连续的空间，依次存放数据，用这种方式存储的线性表就是顺序表其特点就是存储得相邻数据
        其内存地址也是相邻的，比如数组，在js中无需指定数组的长度，因为js引擎会自动分配大小，但是当存储的大小
        不够的时候，操作系统会自动扩充内存然后把之前的数据复制到新的内存中，这种操作是非常消耗性能，因此，如果
        知道数组存储数据的长度就给数组在初始化的时候指定长度，这样可以大大提高性能
        优点：
            根据连续存储的特点，查找数据效率高，可以根据地址进行偏移查询
        缺点：
            1.插入或删除其中的数据，为了确保数据的连续性后面的所有数据都要进行向后或者向前移位，从而消耗了性能
            2.不希望存储大量的数据，根据连续存储的特点如果空间碎片较多会因为存储空间不足而
              无法存储大量的数据(空间碎片是指内存中不连续的存储内存)
        </pre>
        <h3>链表存储(链式存储)</h3>
        <pre>
        存储数据的时候，每存储一条数据都会存储一下当前数据和下一条数据的地址，这样在查找的时候只需要从头遍历链表，这种
        存储结构叫做单向链表存储，其中存储数据的叫做数据域，存储下一条数据的地址叫做引用域。根据存储的下一条地址很容易
        找到下一条数据，但是当查找上一条数据的时候就没法查找，因此为了解决这个问题，使用之前的做法，在当前数据中存储下
        上一条数据的地址，把这种存储方式被称为双向链表存储；
        优点：
            向链表中插入或者删除数据效率很高，因为链表存储无需连续性，只需要修改相邻元素的地址引用和数据域即可
        缺点：
            查找效率低，因为每次查找都会从头开始根据上一个元素的引用域进行查找下一个元素
        </pre>
        <h3>顺序存储和链表存储应用场景</h3>
        <pre>
            如果只进行查询不进行删除和插入操作就可以使用顺序存储，如果需要进行删除和插入操作，或者进行大量的数据存储
            可以使用链式存储
        </pre>
    </div>
</template>

<script>
export default {
}
</script>

<style scoped>

</style>